using System;

namespace Task_2
{
    class Program
    {
        /*
        Создать структуру, определить в ней конструктор с параметрами.
        Продемонстрировать работу конструктора на примере 1 структуры. 
        Создать массив из N структур и выполнить задание согласно своему варианту.
        */

        static void Main(string[] args)
        {
            Console.WriteLine("Решение такое же, как и в пред задании (TASK-1)");
        }
    }
}
