using System;

namespace Examples
{
    class Program
    {
        static void Main(string[] args)
        {
                                      // ТИПЫ ДАННЫХ
    
            //-----------------bool-----------------
        /*
            Хранит значение true или false (логические литералы). 
            Представлен системным типом System.Boolean
        */
            bool alive = true;
            bool IsDead = false;
            //--------------------------------------
            

            //-----------------byte-----------------
        /*
            Хранит целое число от 0 до 255 и занимает 1 байт.
            Представлен системным типом System.Byte
        */
            byte bit1 = 1;
            byte bit2 = 102;
            //--------------------------------------

            
            //-----------------sbyte-----------------
        /*
            Хранит целое число от -128 до 127 и занимает 1 байт. 
            Представлен системным типом System.SByte
        */	
            sbyte bit_1 = -101;
            sbyte bit_2 = 102;
            //--------------------------------------
        }
    }
}
